cask_args appdir: '/Applications'

# Brews
brew  'antidote'
brew  'gcc'
brew  'gemini-cli'
brew  'gpg'
brew  'mas'
brew  'nodenv'
brew  'rbenv'
brew  'shellcheck'
brew  'uv'

# Casks
cask  'caffeine'
cask  'claude-code'
cask  'docker-desktop'
cask  'ghostty'
cask  'google-chrome'
cask  'obsidian'
cask  'spotify'
cask  'visual-studio-code'

# App Store
mas   '1Password 7',        id: 1333542190
mas   'Moom',               id: 419330170
mas   'Slack',              id: 803453959
mas   'Xcode',              id: 497799835
